Abbavanna/MSP430/DLTM_MSP430 _BS.c
//******************************************************************************
// DLTS Steuersoftware
//
//               MSP430G2xx3
//           --------------------
//          |                    |
//          |                    |
//          |                    |
//          |                    |
//          |                    |
//          |VCC              GND|
//          |P1.0/A0    XIN/P2.6 |-XTAL 32kHz
// UART-RXD-|P1.1      XOUT/P2.7 |-XTAL
// UART-TXD-|P1.2           TEST |                      DAC
//          |P1.3/A3         RST |                  ------------
// intens  -|P1.4/A4 P1.7/UCB0SDA|<--------------->|SDA         |
//         -|P1.5/A5 P1.6/UCB0SCL|---------------->|SCL  I2C    |
//          |                    |
//          |P2.0            P2.5|- Y-STEP
// LED_GRN -|P2.1            P2.4|- Y-DIR
// LED_BLUE-|P2.2            P2.3|- PULSOUT = Pulsgeneratorausgang
//          |                    |
//
//******************************************************************************
//Fehlersuche sporadisches aufhängen:
//-readMultiADC() auskommentiert: ändert nichts
//-I2C-Geschwindigkeit reduzieren: scheint aufhängen zu verringern
//passiert nur, wenn zu schnell Befehle über UART nachgeschoben werden(TBC)

//Todo:
//-cancel I2C-transfer if no ACK comming +send error message (maybe with UCNACKIE ?)
//-in  SendACK():  100ms wait rauswerfen
//-MCP4728 Ref auf intern ändern! (210910: VDD=Vref -> Laserintens beeinflusst +5V (~80mV) -> X,Z,Tilt werden mit beeinflusst!
//  -> DAC-Platine auch modifizieren: R1-R6->300k

//Version:
//170925:-aus 170505 Poti+Tasterauslesungen rausgeworfen
//180117: fusioniertes Ü-Protokoll eingebaut (angefangen)
//180222: added scan mode
//180418: modified ADC-read for scanning, added UART-FIFO
//180xxx: SEL-Scan added, I2C functions changed (Andreas) Bug: SEL-Scan sends SEL-Pos only each 5.pos -> bei SEL zu schnell gescannt
//180xxx: Baudrate changed to 115200 (Andreas)
//1908ff: SEL-scan-Bug-fixing
//          -Datenkonvertierung von MAX9611 korrigiert
//          -Wartedelay in SEL-Fall invertiert (hat vorher gewartet, wenn kein SEL)
//          -Init nach Scanende zerstört UART-Verbindung
//          -UART-Debugstrings entfernt (waren ohne Protokollbezug und zerstören Datenverbindung)
//          -delayms() Aufrufe durch SysTick ersetzt
//191113: Multiscan "asm" implementiert, scan-Funktionsteile(init+step) ausgelagert
//200123: ?
//200517:   "slf" "slp" in UART korrigiert (waren vermischt)
//          timings in SEE_puls() vergroessert (Verhalten von "alp" war nicht richtig -viele Pulse und I nicht immer zurueckgesetzt)
//200531:   -MAX9611-Doppelinit korrigiert -> Comp-Mode (ohne 1ms-Delay funzt jetzt)
//          -DAC MCP4728 schnelle Aktualisierung (cmd SingleWrite(30ms, wegen EEPROM-write) -> MultiWrite)
//2006xx: use DUT-voltage as SEL-Detection while scanning
//200828: added commands "gdc" and "gdv" (GetDutCurrent, GetDutVoltage)
//210525: MAX9611 & SELDelay -I2C-Disabled
//211021: MAX9611 & SELDelay -I2C-Enabled and optional disable-#defines implemented
//211022: MCP4728 umkonfiguriert (Vref=Int,Gain=2) (bisher war Vdd=Vref)


//to disable I2C-communication: (for testing with LaunchPad without I2C-slaves)
//#define MCP4728DISABLED
//#define MAX9611DISABLED

#include <msp430.h>     //  /usr/lib/gcc/msp430/4.6.3/plugin/include/config/msp430/msp430.h     /usr/msp430/include
#include <stdint.h>
#include <stdbool.h>
void enablePulsGen(unsigned short freq);    //----- TimerA0-Init (Pulsgen)------
void disablePulsGen();
void MCP4728_FastWrite(unsigned short chan0, unsigned short chan1, unsigned short chan2, unsigned short chan3);
void MCP4728_MultiWrite(unsigned char channel, unsigned short data);
void delay(unsigned short);
void uart0_receive(unsigned char data);     //analyzes received UART data
void UART_TX(char TX);      //Byte über UART senden
void initialize(void);                      // Configure modules and control Registers
void readMultiADC();
void readSingleADC();
void SEE_Puls();    //einzelnen Puls mit anderer Intensitaet rausballern
void SendACK();
void SendERR(char message[]);
unsigned short readMAX9611_current();
unsigned short readMAX9611_voltage();

//Andreas - define - begin
#define VOLTAGE_CALIBRATION_CONSTANT        1.372
#define CURRENT_CALIBRATION_CONSTANT_Gain1  0.315
#define CURRENT_CALIBRATION_CONSTANT_Gain4  0.315   //not tested
#define CURRENT_CALIBRATION_CONSTANT_Gain8  0.315   //not tested

#define MCP4728_ADDR  0x60  //DAC I2C ADRESS
#define MAX9611_ADDR  0xFF  //CSM I2C ADRESS
#define MSP430_SLAVE_ADDR  0x48  //Latchup delay timer
#define AD7997_ADR    0x20  //Adresse von I2C-ADC (unused)

#define CMD_TYPE_0_MASTER      3
#define CMD_TYPE_1_MASTER      4
#define CMD_TYPE_2_MASTER      5

#define TYPE_0_LENGTH   1
#define TYPE_1_LENGTH   2
#define TYPE_2_LENGTH   3

#define MAX_BUFFER_SIZE     20

//MAX9611 data register
#define CMD_CSAMSB_SLAVE        0x00
#define CMD_CSALSB_SLAVE        0x01
#define CMD_RSMSB_SLAVE         0x02
#define CMD_RSLSB_SLAVE         0x03
#define CMD_OUTMSB_SLAVE        0x04
#define CMD_OUTLSB_SLAVE        0x05
#define CMD_SETMSB_SLAVE        0x06
#define CMD_SETLSB_SLAVE        0x07
#define CMD_TEMPMSB_SLAVE       0x08
#define CMD_TEMPLSB_SLAVE       0x09
#define CMD_CTL1_SLAVE          0x0A
#define CMD_CTL2_SLAVE          0x0B

//MAX9611 control register
uint8_t CR1_CSA_Gain1       [TYPE_0_LENGTH] = {0x00}; //Read CSA output from ADC, gain = 1x
uint8_t CR1_CSA_Gain1_COMP  [TYPE_0_LENGTH] = {0xE0}; //Read CSA output from ADC, gain = 1x
uint8_t CR1_CSA_Gain4       [TYPE_0_LENGTH] = {0x01}; //Read CSA output from ADC, gain = 4x
uint8_t CR1_CSA_Gain4_COMP  [TYPE_0_LENGTH] = {0xE1}; //Read CSA output from ADC, gain = 4x
uint8_t CR1_CSA_Gain8       [TYPE_0_LENGTH] = {0x02}; //Read CSA output from ADC, gain = 8x
uint8_t CR1_CSA_Gain8_COMP  [TYPE_0_LENGTH] = {0xE2}; //Read CSA output from ADC, gain = 8x
uint8_t CR1_RS              [TYPE_0_LENGTH] = {0x03}; //Read average voltage of RS+ (input common-mode voltage) from ADC
uint8_t CR1_FRM             [TYPE_0_LENGTH] = {0x07}; //Read all channels in fast-read mode, sequentially every 2ms. Uses last gain setting
uint8_t CR1_FRM_COMP        [TYPE_0_LENGTH] = {0xE7}; //Read all channels in fast-read mode, sequentially every 2ms. Uses last gain setting
uint8_t CR1_TEMP            [TYPE_0_LENGTH] = {0x06}; //Read internal die temperature from ADC
uint8_t CR2                 [TYPE_0_LENGTH] = {0x00}; //MAX9611-WDT settings

//Andreas - define - end

