Abbavanna/MSP430/DLTM_MSP430 _BS.c
void AD7997_SingleRead(unsigned char channel)   //was never used yet
{   int adc_cmd = ((channel<<4) + 0x80) & 0xFF;
    I2C_Master_ReadReg(AD7997_ADR, adc_cmd, 1);
}

void initI2C()
{   UCB0CTL1 |= UCSWRST;                      // Enable SW reset
    UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;     // I2C Master, synchronous mode
    UCB0CTL1 = UCSSEL_2 + UCSWRST;            // Use SMCLK, keep SW reset
    UCB0BR0 = 40;                            // fSCL = SMCLK/160 = ~100kHz
    UCB0BR1 = 0;
    UCB0I2CSA = MAX9611_ADDR;                   // Slave Address
    UCB0CTL1 &= ~UCSWRST;                     // Clear SW reset, resume operation
    UCB0I2CIE |= UCNACKIE;
    //-------- Folgendes aus Initialize() - I2C-Init -------------
    //UCB0CTL1 = UCSSEL_1 + UCSWRST;            // Use ACLK(32kHz), keep SW reset
    //UCB0BR0 = 32;                             // fSCL = SMCLK/12 = ~100kHz  (mit 100kHz bleibt er gelegentlich hängen!!!)
    //UCB0BR0 = 2;                             // fSCL = ACLK/1 = ~32kHz    ( >1 ! )
    P1SEL |= BIT6 + BIT7;                     // Assign I2C pins to USCI_B0
    P1SEL2|= BIT6 + BIT7;                     // Assign I2C pins to USCI_B0
    IE2 |= UCB0TXIE;                        // Enable TX ready interrupt
    IE2 |= UCB0RXIE;                        // Enable RX interrupt
}

//Andreas - fun - end

unsigned long setNextScanPos(void)   //move to next X-pos for scanning (called from main())
{   unsigned long  SysTickScanStep;
    SysTickScanStep = SysTick + PosXdelay;  //calculate and set time for next scan x-step
    PosX += PosXstep;                   //move to next X-pos
    if (PosX <= PosXmax)                //still in range of X
    {   MCP4728_MultiWrite(3, PosX);   //set X-pos
    }
    else                                //out of range in X
    {   PosX = PosXmin;                 //reset X-Position to min
        MCP4728_MultiWrite(3, PosX);   //set X-pos
        SysTickScanStep = SysTick + PosYdelay;  //set wait delay for Y
        PosY += PosYstep;               //move to next Y-pos

        if (PosY > PosYmax)             //whole picture scanned
        {   SysTickScanStep=0;
            mode=MODE_MANUPOS;
            enablePulsGen(PosF);        // Pulsgenerator anschalten Parameter: Frequenz(8Hz-500kHz(?))
        }
    }
    return SysTickScanStep;
}

unsigned long setNextScanPos_mul(void)   //move to next X-pos for scanning (called from main())
{   unsigned long  SysTickScanStep;
    if (PosI<PosImin){

        SysTickScanStep=0;
        mode=MODE_MANUPOS;
        enablePulsGen(PosF);        // Pulsgenerator anschalten Parameter: Frequenz(8Hz-500kHz(?))
    }

    SysTickScanStep = SysTick + PosXdelay;  //calculate and set time for next scan x-step
    PosX += PosXstep;                   //move to next X-pos
    if (PosX <= PosXmax)                //still in range of X
    {   MCP4728_MultiWrite(3, PosX);   //set X-pos
    }
    else                                //out of range in X
    {   PosX = PosXmin;                 //reset X-Position to min
        MCP4728_MultiWrite(3, PosX);   //set X-pos
        SysTickScanStep = SysTick + PosYdelay;  //set wait delay for Y
        PosY += PosYstep;               //move to next Y-pos
        if (PosY > PosYmax)             //whole picture scanned

        { PosI= PosI-PosIstep;
            MCP4728_MultiWrite(0, PosI);
            PosY=PosYmin;
            PosX=PosXmin;
        }
    }
    return SysTickScanStep;
}

unsigned long focus(void)    //Auto focus function implemented by pavan.. Need to update based on hardware changes !
{   unsigned long  SysTickScanStep;
    unsigned short reflectivity, voltage;

    switch (steps_auto)

    {

        case 0:
        PosX = PosXmin;
        PosY=PosYmin;
        break;
        case 1:
        PosX = PosXmin;
        PosY=PosYmax;
        break;
        case 2:
        PosX = PosXmax;
        PosY=PosYmax;
        break;
        case 3:
        PosX = PosXmax;
        PosY=PosYmin;
        break;
        case 4:
        PosX = (PosXmax - PosXmin)/2;
        PosY= (PosYmax - PosYmin)/2;
        break;
        case 5:
        PosX = (PosXmax - PosXmin)/2;
        PosY= PosYmin;
        break;
        case 6:
        PosX = (PosXmax - PosXmin)/2;
        PosY= PosYmax;
        break;
        case 7:
        PosX = PosXmax;
        PosY= (PosYmax - PosYmin)/2;
        break;
        case 8:
        PosX =PosXmin;
        PosY= (PosYmax - PosYmin)/2;
        break;
        default:
        SysTickScanStep=0;
        mode=MODE_MANUPOS;
        enablePulsGen(PosF);
        min_adc_val=0x03ff;
        PosZ=best_adc_val;

        steps_auto=0;

        MCP4728_MultiWrite(1, best_adc_val);
        max_adc_val=0;
        return SysTickScanStep;
    }
    MCP4728_MultiWrite(3, PosX);

    SysTickScanStep = SysTick + PosXdelay;  //calculate and set time for next scan x-step
    PosZ += PosZstep;                   //move to next Z-pos

    if (PosZ <= PosZmax)                //still in range of X
    {   MCP4728_MultiWrite(1, PosZ);   //set X-pos
    }
    else                                //out of range in X
    {   PosZ = PosZmin;                 //reset X-Position to min
        MCP4728_MultiWrite(1, PosZ);   //set X-pos
        steps_auto++;
    }


    P2OUT |= PULSOUT;                   // P2.3 high
    P2OUT &= ~PULSOUT;                  // P2.3 low
    readSingleADC();                    // read out internal ADC to get reflectivity value
    delayms(12);    // delay removed for fast scanning (!!! no current mesurement after latchup possible !!!)
    //SysTickScanStep = SysTick + 10;     //wait for new adc conversion (2*2ms(conv time)->async->nyquist) and register transfer complete
    reflectivity = 0x03ff - ADC10MEM;   //invert reflectivity value from ADC
    voltage = readMAX9611_voltage(); //read voltage from DUT and returns value in 10mV
    if (reflectivity < min_adc_val){
        min_adc_val=reflectivity;
    }
    if (reflectivity > max_adc_val){
        max_adc_val = reflectivity;
        best_adc_val=PosZ;
    }
    avg_adc_val = (max_adc_val - min_adc_val)/2;

    UART_TX((unsigned char)(reflectivity >> 8));  //transmit MSB of refletivity
    UART_TX((unsigned char)reflectivity);  //transmit LSB of reflectivity
    //  UART_TX((unsigned char)(voltage >> 8)); //transmit MSB
    //UART_TX((unsigned char)voltage);        //transmit LSB
    UART_TX((unsigned char)(avg_adc_val >> 8)); //transmit MSB
    UART_TX((unsigned char)avg_adc_val);        //transmit LSB
    //UART_TX((unsigned char)(PosZ >> 8)); //transmit MSB
    //UART_TX((unsigned char)PosZ);        //transmit LSB
    UART_TX((unsigned char)(best_adc_val >> 8)); //transmit MSB
    UART_TX((unsigned char)best_adc_val);        //transmit LSB
    //UART_TX((unsigned char)'-');
    return SysTickScanStep;
}

int main(void)
{
    unsigned long  SysTickScanStep=0;
    unsigned char data; //buffer for received data

