Abbavanna/MSP430/DLTM_MSP430 _BS.c
        SysTickScanStep = setNextScanPos();     //move to next X-pos and set new waiting-time
        //if(current>13) //wait if an SEL occours;  //Todo: make this dynamic/coupled with SEL-Delay!
        if(voltage<100) //wait if an SEL occours (after SEL DUT-Vcc is switched off);   //Todo: make this dynamic/coupled with SEL-Delay!
        {
            SysTickScanStep+=40;  //increase Step delay in case of Latchup (time to recover is around 800ms in ATtiny20)
        }
    }

    if((mode == MODE_MULTINSSCAN) && (SysTick >= SysTickScanStep))     //Multi Intensity Scan algorithm implemented by pavan

    {
        unsigned short reflectivity, current, voltage;
        // uint16_t reflectivity, current, voltage_mul;
        current = readMAX9611_current(); //read current from DUT and returns value in mA
        P2OUT |= PULSOUT;                   // P2.3 high
        P2OUT &= ~PULSOUT;                  // P2.3 low
        readSingleADC();                    // read out internal ADC to get reflectivity value
        delayms(12);    // delay removed for fast scanning (!!! no current measurement after latchup possible !!!)
        reflectivity = 0x03ff - ADC10MEM;   //invert reflectivity value from ADC
        voltage = readMAX9611_voltage(); //read voltage from DUT and returns value in 10mV


        /* Binary search */

        if((PosI_mul_max - PosI_mul_min) <= PosIstep){

        flage_rev=0;
            goto send;
        }
        if((PosI_mul_max == PosImid) || (PosI_mul_min == PosImid)){

        flage_rev=0;
            goto send;
        }

        if((voltage<vol_limit)&&(flage_rev==1)){

            // PosImax = PosI;
            //flage_rev=0;         // Debugging
            //goto send;
            PosI_mul_max=PosImid;
        PosImid=((PosI_mul_max - PosI_mul_min)/ 2) + PosI_mul_min;
        PosI=PosImid;
        MCP4728_MultiWrite(0, PosI);
        }

        if((voltage>=vol_limit)&&(flage_rev==1)){
        /*  if(PosI<PosImax){
                PosI= PosI+PosIstep;                    // Debugging
            MCP4728_MultiWrite(0, PosI);}
            else{
                flage_rev=0;
                goto send;
        }*/

        PosI_mul_min=PosImid;
        PosImid=(PosI_mul_max - PosI_mul_min)/ 2;
        PosI=PosImid;
        MCP4728_MultiWrite(0, PosI);
        }

        if((voltage<vol_limit)&&(flage_rev==0)) //Checking the latchup condition

        //voltage<100,( SEE_FLAG>1  add SEE_FLAG=0),current>13, 0x08 & P1IN    // various conditions to check for SEL
        {

            //PosI_mul_max=PosImax;
            //PosI_mul_min=PosImin;

            PosImid=(PosImax - PosImin)/ 2;
            flage_rev=1;
            PosI=PosImid;
            MCP4728_MultiWrite(0, PosI);
            //PosImax = PosI;
            // Practically, when the latchup occurs, it should send Intensity,Voltage and current here

        }

        send:
        if(flage_rev==0){
            UART_TX((unsigned char)(reflectivity >> 8));  //transmit MSB of reflectivity
            UART_TX((unsigned char)reflectivity);  //transmit LSB of reflectivity

            UART_TX((unsigned char)(PosI >> 8));   //transmit MSB of intensity
            UART_TX((unsigned char)PosI);          //transmit LSB of intensity

            UART_TX((unsigned char)(current >> 8));  // transmit MSB of current
            UART_TX((unsigned char)current);         // transmit LSB of current

            UART_TX((unsigned char)(voltage >> 8));  //transmit MSB of voltage
            UART_TX((unsigned char)voltage);        //transmit LSB of voltage
            SysTickScanStep = setNextScanPos();   // Here it moves to the next scan position
            // PosI=PosImin;                         // Here The Intensity is again brought back to minimum for the next scan position
            SysTickScanStep+=40;
            //PosI= PosI+PosIstep;                    // Intensity Increment
            //MCP4728_MultiWrite(0, PosI);
            PosI=PosImax;
            MCP4728_MultiWrite(0, PosI);
        }





    }

    if((mode == MODE_AUTOFOCUS) && (SysTick >= SysTickScanStep))     //Auto Focus mode implemented by pavan
    {
        SysTickScanStep = focus();      //move to next X-pos and set new waiting-time

    }
    }
}

void SEE_Puls()                 //einzelnen Puls mit anderer Intensitaet
{   disablePulsGen();
    P2OUT ^= LEDg;              // toggle LED
    P2SEL &= ~PULSOUT;          // P2.3 option PIO select
    P2OUT |= PULSOUT;           // P2.3 high
    delayms(1);
    MCP4728_MultiWrite(0,PosP);// SEE-Puls Intensität setzen (channel, data)
    delayms(30);                 //hier is ne Pause notwendig, zwischen 2*SingleWrite wird mind delay(2000) benötigt (veraltet?! (wegen SingleWrite))
    P2OUT &= ~PULSOUT;          // P2.3 low => trigger pulse
    delayms(2);                 //hier is ne Pause notwendig delayms(2);
    MCP4728_MultiWrite(0,PosI);// zurück auf alte Intensität (channel, data)
    delayms(30);                    //delayms(1);
    enablePulsGen(PosF);        //-----TimerA0-Init (Pulsgen)------
    P2OUT ^= LEDg;              // toggle LED
}
void UART_TX(char TX)
{   while (!(IFG2&UCA0TXIFG)); UCA0TXBUF = TX;                    // TX character
}

void initialize(void)   // setup ports, Timers, and variables - run once at start
{   volatile int i;
    WDTCTL = WDTPW + WDTHOLD;                 // Stop Watchdog Timer
    //----- PIO-Init ------
    P2DIR |= LEDb+LEDg;         // Set LED to output direction
    P2DIR |= Y_STEP+Y_DIR;      // Set Y-Achsensteuerpins
    //  P2SEL  &=~(BIT6+BIT7);  //Quarz-Pins als PIO konfigurieren (G2553.pdf S54)
    //  P2SEL2 &=~(BIT6+BIT7);  //Quarz-Pins als PIO konfigurieren (G2553.pdf S54)
    //  P2DIR |= BIT6+BIT7;     //Quarz-Pins als PIO konfigurieren (G2553.pdf S54)

    //  P2REN |= TASTER1+TASTER2;   // Enable Pull Up/Down
    //  P2OUT |= TASTER1+TASTER2;           // Enable Pull Up??? Ändert nichts
    //---------- init CLK -----------
    if (CALBC1_16MHZ==0xFF)         // If calibration constant erased
    {   while(1)                    // stop program and start panic-blink
        {   P2OUT |= LEDb + LEDg;       // LED on
            delay(2000);                // short wait
            P2OUT &= ~(LEDb + LEDg);    // LED off
            delay(2000);                // short wait
        }
    }
    DCOCTL = 0;                               // Select lowest DCOx and MODx settings
    BCSCTL1 = CALBC1_16MHZ;                    // Set DCO for 16MHz
    DCOCTL = CALDCO_16MHZ;
    //---------- init UART -----------
    P1SEL |= BIT1 + BIT2 ;                     // P1.1 = RXD, P1.2=TXD
    P1SEL2 |= BIT1 + BIT2 ;                    // P1.1 = RXD, P1.2=TXD
    UCA0CTL1 |= UCSSEL_2;                     // use SMCLK for UART
    UCA0BR0 = 138;                             // 16MHz 115200Baud
    UCA0BR1 = 0;
    UCA0MCTL = UCBRS2 + UCBRS0;               // Modulation UCBRSx = 5
    UCA0CTL1 &= ~UCSWRST;                     // **Initialize USCI state machine**
    IE2 |= UCA0RXIE;                // Enable USCI_A0 RX interrupt
    //-------- I2C-Init -------------
    P1SEL |= BIT6 + BIT7;                     // Assign I2C pins to USCI_B0
    P1SEL2|= BIT6 + BIT7;                     // Assign I2C pins to USCI_B0
    UCB0CTL1 |= UCSWRST;                      // Enable SW reset
    UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;     // I2C Master, synchronous mode
    UCB0CTL1 = UCSSEL_2 + UCSWRST;            // Use SMCLK, keep SW reset
    //UCB0CTL1 = UCSSEL_1 + UCSWRST;            // Use ACLK(32kHz), keep SW reset
    UCB0BR0 = 32;                             // fSCL = SMCLK/12 = ~100kHz  (mit 100kHz bleibt er gelegentlich hängen!!!)
    //UCB0BR0 = 2;                             // fSCL = ACLK/1 = ~32kHz    ( >1 ! )
    UCB0BR1 = 0;
    UCB0I2CSA = 0x60;                       // Set slave address
    UCB0CTL1 &= ~UCSWRST;                   // Clear SW reset, resume operation
    IE2 |= UCB0TXIE;                        // Enable TX ready interrupt
    IE2 |= UCB0RXIE;                        // Enable RX interrupt
    //----------- ADC-Init von msp430g2x33_adc10_10.c
    ADC10AE0 |= /*BIT0+BIT3+*/BIT4;//+BIT5;     // ADC option select = Analog (Input) Enable Control
    //  ADC10CTL1 = INCH_4 + CONSEQ_1;                      //(sequence-mode) highest Channel in Sequence, single sequence
    //  ADC10CTL0 = ADC10SHT_2 + MSC + ADC10ON + ADC10IE;   //(sequence-mode)
    //  ADC10DTC1 = 2;                          // 2 conversions (=Kanäle)
    ADC10CTL0 = /*SREF_1 + REFON + */ADC10SHT_2 + ADC10ON;// + ADC10IE; // (1chan-mode) ADC10ON, interrupt enabled
    ADC10CTL1 = INCH_4;                         // (1chan-mode) input A4 ( = INTENSITY)
    //----- SysTick-Timer-Init ------
    TA0CCTL0 = CCIE;                             // CCR0 interrupt enabled
    //  TA0CCR0 = 1000-1;   //10000 = 100ms pro Systick
    //  TA0CTL = TASSEL_2 + MC_1;                  // SMCLK(1MHz), upmode
    CCR0 = 33-1;    //33 =~1ms 32768 =1s pro Systick
    TACTL = TASSEL_1 + MC_1;                  // ACLK(32kHz), upmode
    //-----------p1.3 interrupt-init ------
    P1DIR &= BIT3;
    P1IES |= BIT3;                             // P1.1 Hi/Lo edge
    P1IFG = 0;                                // Clear all P1 interrupt flags
    P1IE = BIT3;                              // P1.1 interrupt enabled
    P1IFG &=~BIT3;
    //PM5CTL0 &= ~LOCKLPM5;
    //--------
    __enable_interrupt();                     // Enable interrupts
}
//>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void enablePulsGen(unsigned short freq) //----- TimerA0-Init (Pulsgen)------
{   long period;
    P2DIR |= PULSOUT;                            // P2.3 output
    P2SEL |= PULSOUT;                            // P2.3 option select
    TA1CCTL0 = OUTMOD_4;                         // CCR0 toggle mode
    if(freq>10000) freq=10000;  //Maximalfrequent auf 10kHz begrenzen
    //  period=500000/(long)freq;   // freq in CCR0-Periodenwert umrechnen (TA1 mit SMCLK(1MHz))
    period=(32768/2)/(long)freq;    // freq in CCR0-Periodenwert umrechnen (TA1 mit ACLK(32kHz))
    if(period>0xffff)   period=0xffff;  // Wert auf 16bit begrenzen (500000/65535Hz ~7,62951Hz)
    TA1CCR0 = (short) period;   // 500-1=1kHz
    //  TA1CTL = TASSEL_2 + MC_1;                  // SMCLK(1MHz), upmode
    TA1CTL = TASSEL_1 + MC_1;                  // ACLK(32kHz), upmode
}
void disablePulsGen()
{   TA1CTL = MC_0;                  // disable timer (MC=0)
}
//>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<
void readMultiADC() //liest mehrere ADC-Kanäle auf einmal
{   ADC10CTL0 &= ~ENC;
    while (ADC10CTL1 & ADC10BUSY);          // Wait if ADC10 core is active
    ADC10SA = (short) &ADCdata[0];          // Data buffer start
    ADC10CTL0 |= ENC + ADC10SC;              // Sampling and conversion start
    __bis_SR_register(/*CPUOFF + */GIE);        // LPM0, ADC10_ISR will force exit
}
//>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<
//from msp430g2x33_adc10_01.c
void readSingleADC()    //reads 1 ADC-channel (=read reflected intensity)
{//  ADC10AE0 |= 0x02;                         // PA.1 ADC option select
    ADC10CTL0 |= ENC + ADC10SC;             // Sampling and conversion start
    while(ADC10CTL1 & 0x01);//ADC10BUSY);   // wait until conversion completed
    //__bis_SR_register(CPUOFF + GIE);      // LPM0, ADC10_ISR will force exit
}
//>>>>>>>>>>>>>>>>>>>>>>><<<<<<<<<<<<<<<<<<<<<<<<<<<<<

#define NOP asm volatile("  nop");
void delay(unsigned short dauer)
{   while(dauer--) { NOP NOP NOP NOP NOP NOP NOP NOP NOP NOP }
}

