Abbavanna/MSP430/DLTM_MSP430 _BS.c
                case 'n': //action scan multi (scans refl., current and voltage values)
                if (mode != MODE_SCANPAUSE && mode != MODE_MULTINSSCAN) init_scanStart();
                uart_state=START;   // uart back to start condition
                mode = MODE_MULTINSSCAN;   //set mode to scan-mode
                PosAltI = PosImax;//PosAltI=PosImin;
                PosI = PosImax;
                PosI_mul_max=PosImax;
                PosI_mul_min=PosImin;
                MCP4728_MultiWrite(0, PosI);
                break;
                case 'J': //action scan multi (scans refl., current and voltage values)
                if (mode != MODE_SCANPAUSE && mode != MODE_AUTOFOCUS)   init_scanStart();
                uart_state=START;   // uart back to start condition
                MCP4728_MultiWrite(0, PosI);
                mode = MODE_AUTOFOCUS;   //set mode to scan-mode
                break;
                default:                //Bei anderen Werten
                SendERR("Wrong Scan Action command received!");     // Fehler melden
                uart_state=START;   // zurück in Grundzustand
            }
            break;
            default:                        //Bei anderen Werten
            SendERR("Wrong Action command received!");      //Fehler melden
            uart_state=START;           // zurück in Grundzustand
        }
        if(uart_state != START) // Wenn kein Fehler aufgetreten [hen] oder kein ack gesendet werden soll
        {   SendACK();                      // Bestaetigung antworten
        }
        uart_state=START;                   // zurück in Grundzustand
        break;
        default :   SendERR("uart_state-maschine error!");          //Fehler melden
        uart_state=START;               // zurück in Grundzustand
    }
}

//>>>>>>>>>>>>>>>>>>>> ISR <<<<<<<<<<<<<<<<<<<<<<<<<
// Timer A0 interrupt service routine
void __attribute__ ((interrupt(TIMER0_A0_VECTOR))) Timer_A (void)
{   SysTick++;
    if(SysTick%2)   // if odd millisecond
    {   if(PosYIst>PosY) //Y_Schritt(1);
        {   //Hier Endlage abfragen!!!
            P2OUT|=Y_DIR;
            if(PosYIst>0) PosYIst--;
            P2OUT|=Y_STEP;  //rising edge = make motor step
        }
        if(PosYIst<PosY) //Y_Schritt(0);
        {   P2OUT&=~Y_DIR;
            if(PosYIst<POSYMAX) PosYIst++;
            P2OUT|=Y_STEP;  //rising edge = make motor step
        }
    }
    else    // if even millisecond
    P2OUT&=~Y_STEP; //Schrittausgang auf 0 setzen (TI: min.Pulsbreite 1us!)
}
//------------------------------------------------------------------------------
// The USCIAB0TX_ISR is structured such that it can be used to transmit any
// number of bytes by pre-loading TXByteCtr with the byte count. Also, TXData
// points to the next byte to transmit.
// aus: msp430g2xx3_uscib0_i2c_08.c
//------------------------------------------------------------------------------
void __attribute__ ((interrupt(USCIAB0TX_VECTOR))) USCIAB0TX_ISR (void)
{   if (IFG2 & UCB0RXIFG)                 // Receive Data Interrupt
    {   //Must read from UCB0RXBUF
        uint8_t rx_val = UCB0RXBUF;

        if (RXByteCtr)
        {   ReceiveBuffer[ReceiveIndex++] = rx_val;
            RXByteCtr--;
        }
        if (RXByteCtr == 1)
        {   UCB0CTL1 |= UCTXSTP;
        }
        else if (RXByteCtr == 0)
        {   IE2 &= ~UCB0RXIE;
            MasterMode = IDLE_MODE;
            __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
        }
    }
    else if (IFG2 & UCB0TXIFG)            // Transmit Data Interrupt
    {   switch (MasterMode)
        {   case TX_REG_ADDRESS_MODE:
            UCB0TXBUF = TransmitRegAddr;
            if (RXByteCtr)
            MasterMode = SWITCH_TO_RX_MODE;   // Need to start receiving now
            else
            MasterMode = TX_DATA_MODE;        // Continue to transmision with the data in Transmit Buffer
            break;
            case SWITCH_TO_RX_MODE:
            IE2 |= UCB0RXIE;              // Enable RX interrupt
            IE2 &= ~UCB0TXIE;             // Disable TX interrupt
            UCB0CTL1 &= ~UCTR;            // Switch to receiver
            MasterMode = RX_DATA_MODE;    // State state is to receive data
            UCB0CTL1 |= UCTXSTT;          // Send repeated start
            if (RXByteCtr == 1)
            {   //Must send stop since this is the N-1 byte
                while((UCB0CTL1 & UCTXSTT));
                UCB0CTL1 |= UCTXSTP;      // Send stop condition
            }
            break;
            case TX_DATA_MODE:
            if (TXByteCtr)
            {   UCB0TXBUF = TransmitBuffer[TransmitIndex++];
                TXByteCtr--;
            }
            else
            {   //Done with transmission
                UCB0CTL1 |= UCTXSTP;     // Send stop condition
                MasterMode = IDLE_MODE;
                IE2 &= ~UCB0TXIE;                       // disable TX interrupt
                __bic_SR_register_on_exit(CPUOFF);      // Exit LPM0
            }
            break;
            default:
            __no_operation();
            break;
        }
    }
}
//  Wenn Zeichen über UART empfangen
void __attribute__ ((interrupt(USCIAB0RX_VECTOR))) USCI0RX_ISR (void)
{    fifo_add(UCA0RXBUF);        //put received byte into fifo-buffer
}
// ADC10 interrupt service routine (=Potiauswertung)
void __attribute__ ((interrupt(ADC10_VECTOR))) ADC10_ISR (void)
{    __bic_SR_register_on_exit(CPUOFF);        // Clear CPUOFF bit from 0(SR)
}



// Port 1 interrupt service routine
#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
    #pragma vector=PORT1_VECTOR
    __interrupt void Port_1(void)
    #elif defined(__GNUC__)
    void __attribute__ ((interrupt(PORT1_VECTOR))) Port_1 (void)
    #else
    #error Compiler not supported!
#endif
{
    SEE_FLAG++;
    P1IFG &= ~BIT3;                           // Clear P1.3 IFG

}
